用户贷款违约预测：https://www.heywhale.com/home/competition/615ff7bdc270e400182b249e/content/1

# 导入模块

In [6]:
%%time
import warnings
warnings.filterwarnings("ignore")
import pandas as pd
from toad import detect

pd.set_option('display.width', 180)
pd.set_option('display.max_rows', None)
pd.set_option('display.max_columns', 100)

Wall time: 0 ns

# 加载数据

In [3]:
%%time
train = pd.read_csv("../data/train.csv")
test  = pd.read_csv("../data/test.csv")

Wall time: 488 ms

# 数据探索

## 查看前五行

### 训练集查看

In [4]:
%%time
train.head()

        id   income  age  experience_years is_married  city  region  current_job_years  current_house_years house_ownership car_ownership  profession  label
0  train_0  8529345   44                 2     single   210       0                  2                   10          rented            no          13      0
1  train_1  7848654   55                 9     single   229       2                  9                   13          rented            no          43      0
2  train_2  8491491   61                20     single   114      28                  8                   11          rented            no          12      0
3  train_3  8631544   69                13    married   276      14                 13                   12          rented            no          27      0
4  train_4  6947233   62                10     single    56      11                 10                   12          rented            no          47      0

### 测试集查看

In [5]:
%%time
test.head()

Wall time: 1e+03 µs

       id   income  age  experience_years is_married  city  region  current_job_years  current_house_years house_ownership car_ownership  profession  label
0  test_0  4260981   47                18     single   118       0                  7                   13          rented            no          39      0
1  test_1  1537266   78                13     single    73      22                  9                   12          rented            no          50      0
2  test_2  4716686   74                11     single    96      25                  9                   10    norent_noown            no           1      0
3  test_3  4245860   34                 3     single   232      14                  3                   11          rented            no           6      0
4  test_4   493379   66                 6     single   145      28                  6                   11          rented           yes          28      0

## 查看数据类型、缺失值和枚举值

In [8]:
%%time
detect(train).iloc[:, :4]

Wall time: 756 ms

                       type    size missing  unique
id                   object  168000   0.00%  168000
income                int64  168000   0.00%   30068
age                   int64  168000   0.00%      59
experience_years      int64  168000   0.00%      21
is_married           object  168000   0.00%       2
city                  int64  168000   0.00%     317
region                int64  168000   0.00%      29
current_job_years     int64  168000   0.00%      15
current_house_years   int64  168000   0.00%       5
house_ownership      object  168000   0.00%       3
car_ownership        object  168000   0.00%       2
profession            int64  168000   0.00%      51
label                 int64  168000   0.00%       2

## 描述性统计

### 训练集查看

In [9]:
%%time
train.describe()

Wall time: 76 ms

             income            age  experience_years           city         region  current_job_years  current_house_years     profession          label
count  1.680000e+05  168000.000000     168000.000000  168000.000000  168000.000000      168000.000000        168000.000000  168000.000000  168000.000000
mean   4.994944e+06      49.961577         10.088887     157.930446      13.801554           6.339571            11.997673      25.251054       0.123065
std    2.879353e+06      17.053195          5.998594      92.123165       9.379915           3.647073             1.399613      14.722342       0.328513
min    1.031000e+04      21.000000          0.000000       0.000000       0.000000           0.000000            10.000000       0.000000       0.000000
25%    2.499018e+06      35.000000          5.000000      78.000000       6.000000           4.000000            11.000000      13.000000       0.000000
50%    4.994848e+06      50.000000         10.000000     157.000000      14.000000           6.000000            12.000000      25.000000       0.000000
75%    7.475446e+06      65.000000         15.000000     238.000000      22.000000           9.000000            13.000000      38.000000       0.000000
max    9.999938e+06      79.000000         20.000000     316.000000      28.000000          14.000000            14.000000      50.000000       1.000000

### 测试集查看

In [10]:
%%time
test.head()

Wall time: 0 ns

       id   income  age  experience_years is_married  city  region  current_job_years  current_house_years house_ownership car_ownership  profession  label
0  test_0  4260981   47                18     single   118       0                  7                   13          rented            no          39      0
1  test_1  1537266   78                13     single    73      22                  9                   12          rented            no          50      0
2  test_2  4716686   74                11     single    96      25                  9                   10    norent_noown            no           1      0
3  test_3  4245860   34                 3     single   232      14                  3                   11          rented            no           6      0
4  test_4   493379   66                 6     single   145      28                  6                   11          rented           yes          28      0

## 特征探索

In [34]:
%%time
train[train["car_ownership"]=="no"].groupby(["label"])["car_ownership"].count()[1] / len(train) * 100

Wall time: 51 ms

8.98154761904762

In [33]:
%%time
train[train["car_ownership"]=="yes"].groupby(["label"])["car_ownership"].count()[1] / len(train) * 100

3.325

In [35]:
def p_decorate(func):
    def func_wrapper(name):
        return "<p>{0}</p>".format(func(name))
    return func_wrapper

@p_decorate
def get_text(name):
    return "lorem ipsum, {0} dolor sit amet".format(name)

get_text("John")

'<p>lorem ipsum, John dolor sit amet</p>'